import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:get/get.dart';
import 'package:google_fonts/google_fonts.dart';

class ConditionsOfUse extends StatefulWidget {
  const ConditionsOfUse({super.key});

  @override
  State<ConditionsOfUse> createState() => _ConditionsOfUseState();
}

class _ConditionsOfUseState extends State<ConditionsOfUse> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        backgroundColor: Color(0xffF8F8F8),
        title: Text(
          "شروط الاستخدام",
          style: GoogleFonts.tajawal(
            fontSize: 17.sp,
            color: Colors.black,
            fontWeight: FontWeight.w600,
          ),
        ),
        leadingWidth: 90.w,
        leading: Padding(
          padding: EdgeInsets.only(left: 15.w),
          child: InkWell(
            onTap: () {
              Get.back();
            },
            child: Icon(
              Icons.arrow_back_ios,
              color: Colors.black,
            ),
          ),
        ),
        toolbarHeight: 60.h,
      ),
      body: Container(
        width: double.infinity,
        decoration: BoxDecoration(
          color: Colors.white,
        ),
        padding: EdgeInsets.symmetric(horizontal: 16.w),
        child: ListView(
          children: [
            SizedBox(
              height: 20.h,
            ),
            Text(
              "شروط الاستخدام",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "مرحبا بكم في تطبيق مدينة الكويت السكنية فضال يرجى قراءة الرشوط واألحكام بعناية قبل\nاستخدام التطبيق والتصفحك أو إضافة أي إعالن لدينا يعترب إقرار منك بقراءة الرشوط واألحكام\nوالموافقة عليها .",
              style: GoogleFonts.tajawal(
                fontSize: 15.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 6.h,
            ),
            Text(
              "متلك تطبيق مدينة الكويت السكنية والذي يـوفر أيضا مساحة لإلعالنات لمستخدميها )البائعني\nوالمشرتين(، ويقترص دور تطبيق مدينة الكويت السكنية عىل توفري مساحة اللتقاء البائع\nوالمشرتي بصورة ميرسة ، وال تتحمل تطبيق مدينة الكويت السكنية أي مسئولية وال توفر أي ضمان\nاتجاه المستخدمني بما يتعلق بعمليات البيع والرشاء وجودة المنتجات، وال يتم الرجوع عليها\nللمطالبة بالتعويض عن أي خسائر",
              style: GoogleFonts.tajawal(
                fontSize: 15.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "تعليمات وقواعد نرش اإلعالن:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "- يتم إدراج اإلعالنات بعد التسجيل برقم الهاتف المحمول والبريد اإللكتروني.\n- يجب على المعلن تصنيف اإلعالن ونشره تحت القسم الصحيح.\n- يجب كتابة عنوان لإلعالن ووصف المنتج والسعر وإضافة الصور بشكل صحيح ويجب أن تكون\nالسلعة حقيقة وموجودة.\n- يجب أن يكون المعلن هو صاحب السلعة أو الخدمة.\n- اإلعالنات تكون بصفة شخصية ويمنع نشر إعالنات بصفة تجارية أو نيابة عن الغير، ويمنع نشر\nاإلعالنات الخاصة بالشركات أو المتاجر.\n- يحظر نشر إعالنات تحتوي على ألفاظ أو صور مخالفة لآلداب العامة أو غير قانونية كذلك يمنع أي\nإعالن يهدف للتشهير باألشخاص او المؤسسات\n- يحظر نشر إعالنات بيع األسلحة بجميع أنواعها سواء كانت مرخصة أو غير مرخصة.\n- يكون كل إعالن لسلعة واحدة فقط، وبحال تعدد السلع فيتم إنشاء إعالن مستقل لكل سلعة.\n- يمنع نشر اإلعالنات الخاصة بالمحامين والتي تهدف إلعالن المحامي عن نفسه أو العمل على جلب\nالموكلين.\n- يحظر نشر اإلعالنات المخالفة للقوانين في دولة منشئ اإلعالن، وكذلك يحظر نشر اإلعالنات\nالمخالفة للقوانين في دولة الكويت وخاصة للقانون رقم 63 لسنة 2015 بشأن مكافحة الجرائم\nاإللكترونية، والقانون رقم 38 لسنة 2002 بشأن تنظيم إعالن المواد المتعلقة بالصحة، ويحظر نشر\nإعالنات األدوية والمنشطات الجنسية.\n- يمنع نشر إعالنات التدخين بكافة أنواعها العادية أو اإللكترونية\n- يحظر بيع النباتات والحيوانات المهددة باالنقراض الواردة في اتفاقية )سايتس(، التزاما بقرارات\nولوائح الهيئة العامة للبيئة.\n- يمنع نشر إعالنات العمالة المنزلية بكافة أنواعها وكذلك يمنع نشر إعالنات العمالة الوهمية أو تأجير\nالعمالة للمنازل في الساعات كذلك يمنع نشر كافة أنواع اإلتجار بالبشر.\n- يمنع نشر أي إعالن للقمار والمراهنات أو إعالنات السحر والشعوذة\n- يمنع نشر أي إعالن للخمور أو المشروبات الروحية بكافة أنواعها - كما تحظر نشر أي اعالن\nللمخدرات والحشيش بكافة أنواعها.\n- يحظر عرض وبيع أجهزة التنصت و وسائل التحريض على إساءة استعمال أجهزة الهاتف، وذلك\nبحسب القانون رقم 9 لسنة 2001 بشأن إساءة استعمال أجهزة االتصاالت الهاتفية وأجهزة التنصت.\n\n- يحظر اإلعالن عن سداد القروض والتكييش، وكذلك يحظر اإلعالن عن الشقق المفروشة بالساعات\nأو اإليجار اليومي لغير الشركات المرخص لها بذلك، وتحظر جميع إعالنات جلب االستثمار والدعوة\nلالستثمار والمشاركة التجارية ،\n- تحتفظ إدارة تطبيق مدينة الكويت السكنية بحق حظر أي رقم هاتف يستخدم التطبيق في اإلساءة أو\nاألضرار بالغير أو بحال استخدام التطبيق ألغراض غير قانونية.\n- يراعي المستخدم احترام المتصفحين والمستخدمين اآلخرين.\n- يمنع حجز اإلعالنات أو حجز التثبيت بغرض بيعها لطرف آخر.\n- يتحمل المستخدم ناشر اإلعالن أي مسائلة قانونية أو أي تعويض دون ادني مسئولية على تطبيق\nمدينة الكويت السكنية .\n- يقر العميل باإلطالع على كافة الشروط الخاصة والعامة باستخدام خدمات التطبيق وبموافقته التامة\nعليها وقبوله لها ، ويقرر بتحمله المسؤولية القانونية \"\الجزائية والمدنية \" عن أى أضرار تلحق\nبالموقع أو القائمين عليه أو الغير فى حال مخالفة القوانين واللوائح والقرارات المنظمة لإلعالن وكافة\nالقوانين والقرارات األخرى السارية بالبالد ، ويعد دخوله على الموقع أو استخدامه للخدمات المتوافرة\nعليه إقراراً وتعهداً منه بذلك\".\n- على ناشر االعالن الخاص بتقديم االعمال الحرفية ان يكون حاصال على ترخيص من الجهات\nالمختصة لمزاولة النشاط، ويرجى من مستخدمي التطبيق التثبت من وجود المستندات والتراخيص\nالالزمة قبل التعاقد مع مقدمي األعمال الحرفية، وذلك دون أدنى مسئولية على تطبيق مدينة الكويت\nالسكنية .\n- اذا تبين عدم وجود ترخيص بمزاولة النشاط للمعلن عن تقديم الخدمات الحرفية ، سيتم الغاء االعالن\nوتزويد الجهات الرسمية في بيانات المعلن متى ما طلبت ذلك.\n- إلدارة تطبيق مدينة الكويت السكنية الحق بمنع أي مستخدم ال يتوافق مع شروط التطبيق",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "إزالة اإلعالنات والتعليقات المخالفة - انتهاء مدة اإلعالن:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "- مدة اإلعالنات المجانية – إن وجدت 30يوم\n- يتم إزالة اإلعالن تلقائيا من التطبيق بعد انتهاء الفترة الزمنية المحددة من قبل إدارة مدينة الكويت\nالسكنية .\n- يتم إزالة اإلعالنات المخالفة دون إبالغ المستخدم المخالف ودون تعويضه، ويحق إلدارة التطبيق\nمنع المستخدم المسيء والمخالف من استرداد قيمة الرصيد المتبقي.\n- عند إلغاء اإلعالن لن تستطيع مشاهدته بصفحة ) اعالناتي (.\n- يحق إلدارة تطبيق منع أي مستخدم ينشر إعالن مخالف مسيئ للغير ويحق إلدارة التطبيق منع\nالمخالف من استخدام التطبيق بشكل مؤقت أو نهائي",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "الحقوق المالية:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "- قيمة ومدة اإلعالن المدفوع تعتمد على القسم المعلن فيه\n- تضاف قيمة أي مميزات أخرى على قيمة اإلعالن.\n- عند استخدام الكي نت لدفع قيمة اإلعالن يجب االحتفاظ بسجل للدفع، وبحالة عدم إضافة الرصيد\nتلتزم إدارة )مدينة الكويت السكنية( بتعويض المستخدم بحال وجود دليل على إتمام عملية السداد\nوخصم المبلغ من الحساب المصرفي للمستخدم.\n- استرجاع قيمة اإلعالن ال يتم إال بحال ثبت وجود خلل في النظام تم بعد السداد.\n- ال يتم استرداد قيمة اإلعالنات المخالفة.\n- بعد شراء الرصيد ال يحق للمستخدم استراد قيمة الرصيد المتوفر.",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "الخصوصية ومشاركة بيانات المستخدمني:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "يحرص تطبيق مدينة الكويت السكنية عىل رسية بيانات المستخدمني، وال يتم مشاركة البيانات إال في\nحدود المسموح به من قبل البائعني عند نرش كل إعالن عىل حده ، ويكون ذلك عرب كتابة البيانات\nالمطلوبة في الحقول الخاصة بالتواصل مثل رقم الهاتف والربيد اإللكرتوني ، ويراعى عدم نرش أي\nإعالنات تخالف قوانني دولة الكويت ، ويوافق المستخدم عند نرش إعالن مخالف للقوانني\nالمعمول بها في دولة الكويت عىل تزويد بياناته للجهات الحكومية المختصة بحال تم طلبها من\nتطبيق مدينة الكويت السكنية وبموجب التعاون الجيد والمستمر بني الجات المختصة بدولة الكويت\nوبني إدارة تطبيق مدينة الكويت السكنية .وسيتم إبالغهم بأي إعالن مخالف لقوانني دولة الكويت،\nويراعي المستخدمني عدم االعتداء عىل حقوق الملكية الفكرية والعالمات التجارية الخاصة\nباآلخرين، وعدم اإلساءة لهم عرب نرش إعالنات مسيئة ، وبحال ثبت لـ) مدينة الكويت السكنية ( ذلك فيحق\nلنا تزويد األطراف المترضرة ببيانات المستخدم المخالف بحال تم طلب بياناته.",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "حقوق الملكية الفكرية:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              " تمتلك إدارة مدينة الكويت السكنية تطبيق مدينة الكويت السكنية كافة حقوق الملكية الفكرية المتعلقة\nبالتطبيق وكذلك كافة محتويات التطبيق بما في ذلك البيانات والصور والمحتويات الفكرية بكافة\nأشكالها الموجودة على التطبيق\n- ال يجوز بأي حال من األحوال محاولة اقتباس محتوى التطبيق اقتباسا كامال أو بطريقة آلية أو جزء\nجوهري منه. كما يحظر استخدام محتوى هذا التطبيق ضمن أي عمل فكرى أخر أو تضمينه في\nقاعدة بيانات إلكترونية. كما يحظر تماما أيضا إعادة بيع محتويات هذا التطبيق أو توزيعه أو التعديل\nعلية أو ترجمته أو إعادة هندسته بأي صورة. كما تحتفظ إدارة التطبيق بكامل الحق في أن تضع من\nالقيود ما يلزم لمنع أي شخص أو موقع إلكتروني آخر من ربط أو اقتباس محتوى هذا التطبيق.\n- كما يحظر إعادة هندسة أو تفكيك البرنامج المستخدم في التطبيق بهدف الوصول إلى برنامج\nالمصدر أو الشفرة األصلية لهذا البرنامج أو الوصول إلى البنية األصلية لهذا التطبيق.",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "التنازل عن اإلعالنات والصور المنشورة:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "متنازالً عن اإلعالن والصور المرفقة به فور رفعه على التطبيق. - يعتبر المستخدم\n- تحتفظ إدارة ) مدينة الكويت السكنية ( بحقها في إعادة استخدام الصور المنشورة في اإلعالنات\nبالشكل الذي تراه مناسب.",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "التعديل عىل الرشوط واألحكام:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "يحق إلدارة مدينة الكويت السكنية .\nتعديل رشوط وأحكام االستخدام الخاصة بها في أي وقت، وتصبح مثل هذه التعديالت نافذة\nبمجرد نرشها عىل التطبيق. وعىل المستخدمني االطالع عىل رشوط وأحكام االستخدام هذه\nدورياً\nلغايات مراجعة أي تعديالت تطرأ عليها. ويعترب استمرار المستخدم باستخدام التطبيق بعد إجراء\nالتعديالت عىل الرشوط واألحكام يعترب موافقة رصيحة منه عىل تلك التعديالت",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
