import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:get/get.dart';
import 'package:google_fonts/google_fonts.dart';

class ConditionsOfUse extends StatefulWidget {
  const ConditionsOfUse({super.key});

  @override
  State<ConditionsOfUse> createState() => _ConditionsOfUseState();
}

class _ConditionsOfUseState extends State<ConditionsOfUse> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        backgroundColor: Color(0xffF8F8F8),
        title: Text(
          "شروط الاستخدام",
          style: GoogleFonts.tajawal(
            fontSize: 17.sp,
            color: Colors.black,
            fontWeight: FontWeight.w600,
          ),
        ),
        leadingWidth: 90.w,
        leading: Padding(
          padding: EdgeInsets.only(left: 15.w),
          child: InkWell(
            onTap: () {
              Get.back();
            },
            child: Icon(
              Icons.arrow_back_ios,
              color: Colors.black,
            ),
          ),
        ),
        toolbarHeight: 60.h,
      ),
      body: Container(
        width: double.infinity,
        decoration: BoxDecoration(
          color: Colors.white,
        ),
        padding: EdgeInsets.symmetric(horizontal: 16.w),
        child: ListView(
          children: [
            SizedBox(
              height: 20.h,
            ),
            Text(
              "الشروط والأحكام لاستخدام تطبيق وموقع هوم كويت للدعاية والاعلان والتسويق .",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "مرحبًا بك في تطبيق وموقع هوم كويت ، يرجى قراءة الشروط والأحكام بعناية لأستخدام الموقع الإلكتروني أو تطبيق الهاتف المحمول ، يُعتبر أنك قد قبلت هذه الشروط والأحكام إذا كنت لا توافق على شروط الاستخدام هذه ، فيرجى الامتناع عن الوصول إلى استخدام الموقع الإلكتروني وتطبيق الهاتف المحمول .",
              style: GoogleFonts.tajawal(
                fontSize: 15.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 6.h,
            ),
            Text(
              "تطبيق وموقع هوم كويت هما عبارة عن منصة إعلانية توفر مساحة إعلانية رقمية لمستخدميها (المشترين والبائعين ومقدمي الخدمات والباحثين عن الخدمة) ليست مسؤولة عن ولا تقدم أي ضمان على أي منتج أو الخدمة المعلن عنها على المنصة بأي شكل من الأشكال ، بما في ذلك عمليات البيع والشراء ، والتمثيل الدقيق للمنتج أو الخدمة ، وجودة المنتج أو الخدمة علاوة على ذلك ، فإن تطبيق وموقع هوم كويت ليس مسؤولاً عن أي مطالبات بالتعويض عن أي خسائر.",
              style: GoogleFonts.tajawal(
                fontSize: 15.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "قواعد  الإعلان داخل التطبيق :",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "- لا يمكن نشر الإعلانات إلا بعد قيام المستخدم بالتسجيل باستخدام رقم هاتف محمول وبريد إلكتروني ثم التحقق منهما.\n- يجب على المعلن تصنيف الإعلان ضمن القسم الصحيح.\n- يجب على المعلن إدخال عنوان الإعلان ووصفه وسعره وصورته بشكل صحيح دون أي تحريفات.\n- أن يكون المعلن هو مالك السلع أو الخدمات التي يتم الإعلان عنها.\n- يجب ألا يحتوي أي إعلان يتم تحميله على أي لغة أو صور غير قانونية أو غير أخلاقية أو فاحشة،  كما يمنع أي إعلان يهدف إلى التشهير بالأشخاص أو المؤسسات.\n- لا يجوز للمعلنين الإعلان أو عرض أي نوع من الأسلحة سواء كانت مرخصة أو غير مرخصة.\n- يمنع بيع النباتات والحيوانات المهددة بالانقراض الواردة في اتفاقية (سايتس)، وذلك التزاماً بقرارات وأنظمة الهيئة العامة للبيئة.\n- لا يجوز للمعلنين الإعلان إلا عن عنصر واحد لكل قائمة يتطلب الإعلان عن عناصر متعددة إنشاء قائمة جديدة لكل عنصر .       \n- يجب أن تكون الإعلانات لمنتجات أو خدمات فردية يُحظر وضع الإعلانات تجاريًا أو بالنيابة عن طرف ثالث كما يمنع وضع إعلانات للشركات أو المحلات التجارية.       \n- لا يسمح للمحامين بالإعلان عن أنفسهم للترويج الذاتي أو لكسب العملاء من خلال التطبيق.       \n- يمنع وضع إعلانات مخالفة لقوانين دولة المعلن. يمنع وضع إعلانات مخالفة للقوانين في دولة الكويت وخاصة القانون رقم 63 لسنة 2015 في شأن مكافحة الجرائم الإلكترونية والقانون رقم 38 لسنة 2002 في شأن تنظيم الإعلانات التجارية للمنتجات المتعلقة بالصحة يحظر وضع إعلانات للأدوية والمنشطات الجنسية.       \n- بموجب القانون رقم 9 لسنة 2001 بشأن إساءة استخدام أجهزة الاتصالات الهاتفية وأجهزة التنصت ، يحظر عرض وبيع أجهزة التنصت والوسائل التي تحرض على إساءة استخدام أجهزة الهاتف.       \n- يمنع الإعلان عن سداد الديون والصرف كما يمنع الإعلان عن الشقق المفروشة للإيجار بالساعة أو اليوم إلا من قبل الشركات المسموح لها بذلك يحظر جميع الإعلانات التي تهدف إلى جذب الاستثمار والدعوة للاستثمار والشراكة التجارية يمنع وضع إعلانات عمالة كاذبة أو إعلانات توظيف عمالة منزلية للعمل في المنازل بالساعة.       \n- يحتفظ تطبيق وموقع هوم كويت بالحق في حظر أي رقم هاتف أو جهاز يستخدم التطبيق للإساءة أو الإضرار بطرف ثالث أو استخدام التطبيق لأغراض غير قانونية.\n- يجب على المستخدمين احترام الزوار والمستخدمين الآخرين.\n- يمنع حجز الإعلانات أو تثبيتها بغرض بيعها لطرف آخر.\n- يكون مستخدم الإعلان مسؤولاً عن أي مسؤولية قانونية أو تعويض، مع عدم وجود مسؤولية على هوم كويت\n- \"يؤكد العميل حصوله على كافة الشروط الخاصة والعامة باستخدام خدمات الموقع وبموافقته وقبوله الكامل لها، ويقرر تحمل المسؤولية القانونية \"الجنائية والمدنية\" عن أي أضرار تلحق بالموقع أو القائمين عليه هو أو غيره في حالة مخالفته للقوانين واللوائح والقرارات المنظمة للإعلان وكافة القوانين والقرارات الأخرى المعمول بها في الدولة، ودخوله على الموقع أو استخدام الخدمات المتاحة له يعتبر إقراراً وتعهداً بذلك.\n- يحق تطبيق وموقع هوم كويت حظر أي مستخدم لا يلتزم بشروط التطبيق\n- تمنع إعلانات التدخين بكافة أنواعها ، العادية أو الإلكترونية\n- يمنع نشر إعلانات العمالة المنزلية بكافة أنواعها ، كما يمنع نشر إعلانات العمالة الوهمية أو تأجير العمالة للمنازل بالساعات، وكذلك نشر كافة أنواع الاتجار بالبشر.\n- يمنع نشر أية إعلانات خاصة بالقمار أو الرهان أو إعلانات السحر والشعوذة\n- يمنع نشر أي إعلان عن الخمور أو المشروبات الروحية بكافة أنواعها - ويمنع نشر أي إعلان عن المخدرات والحشيش بكافة أنواعه.\n- يجب على المعلن عن الأعمال الحرفية الحصول على ترخيص من الجهات الرسمية لمزاولة النشاط، كما يتعين على مستخدمي التطبيق التأكد من وجود المستندات والتراخيص اللازمة قبل التعاقد مع مقدمي الأعمال الحرفية، دون أي مسؤولية على هوم كويت\n-   إذا اتضح عدم وجود ترخيص لمزاولة النشاط للمعلن لتقديم خدمات احترافية سيتم إلغاء الإعلان وسيتم تزويد الجهات الرسمية ببيانات المعلن متى طلب ذلك",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "إزالة الإعلانات والتعليقات المخالفة وانتهاء صلاحية الإعلان :",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              " الإعلان المجاني إن وجد سيبقى لمدة 5 أيام.\n- ستتم إزالة الإعلانات تلقائيًا من التطبيق بعد الفترة الزمنية التي حددها هوم كويت.\n- ستتم إزالة الإعلانات غير الملتزمة دون إشعار المستخدم أو تعويضه. يحق للإدارة منع المستخدم غير الملتزم والمسيء من استرداد أي رصيد متبقي.\n- بمجرد إلغاء الإعلان، لا يمكنك رؤيته في صفحة (قوائمي).\n- يحق لتطبيق وموقع هوم كويت حظر أي مستخدم يقوم بوضع إعلان غير ملتزم، أو إضافة تعليقات مسيئة للآخرين من خلال الرسائل الخاصة أو من خلال (الدردشة المباشرة). يحق للإدارة منع المستخدم غير الملتزم من استخدام التطبيق بشكل مؤقت أو دائم.",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "الحقوق المالية:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "- سعر الإعلان المدفوع  ومدته بناءً على الفئة التي يقوم المستخدم بتحميلها فيها\n- سيتم إضافة تكلفة أي إضافات إلى تكلفة الإعلان.\n- عند استخدام KNET لدفع ثمن أحد الإعلانات، يجب عليك الاحتفاظ بسجل الدفع، في حالة عدم إضافة رصيد إليك. لن يقوم تطبيق وموقع هوم كويت برد الأموال إلا في حالة وجود دليل على أن المعاملة قد تم خصمها من حسابه المصرفي.\n- يمكن للمستخدم الدفع نقداً من خلال مندوب تطبيق وموقع هوم كويت بحد أدنى للدفع 5 د.ك. المندوب متوفر في كل منطقة في الكويت.\n- لا يمكن استرداد الأموال إلا للمستخدمين في حالة حدوث عطل فني في النظام تسبب في خسارة الأموال للمستخدمين.\n- لن يتم استرداد تكلفة الإعلانات غير الملتزمة.\n- بعد شراء الرصيد، لا يجوز للمستخدم استرداد الرصيد المتاح المتبقي.",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "الخصوصية ومشاركة بيانات المستخدمين :",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "تطبيق وموقع هوم كويت يحمي سرية بيانات المستخدمين لن يتم مشاركة البيانات إلا في الحدود المسموح بها من قبل البائعين عند وضع كل إعلان ، وذلك من خلال إدخال البيانات المطلوبة في الحقول المطلوبة لمعلومات الاتصال ، مثل رقم الهاتف والبريد الإلكتروني، مع مراعاة عدم وضع أي إعلان ينتهك قوانين الكويت.\nيوافق المستخدم على تزويد الجهات المعنية ببياناته إذا طلبتها السلطات من هوم كويت في حالة وضع إعلان يخالف القوانين المعمول بها في الكويت أو عن طريق التعليق من خلال الرسائل الفورية أو دعم الدردشة المباشرة بأي طريقة غير قانونية أو بأي شكل من الأشكال يخالف هذه الشروط والأحكام.\nوفي ظل التعاون الجيد والمستمر بين تطبيق وموقع هوم كويت وإدارة مكافحة الجرائم الإلكترونية الكويتية، سيتم إشعارهم بأي إعلان يخالف قوانين الكويت يجب على المستخدمين ألا ينتهكوا حقوق الملكية الفكرية والعلامات التجارية للآخرين ويجب ألا يسيئوا إلى المستخدمين أو الأشخاص الآخرين من خلال الرسائل الفورية أو التعليقات أو النشر أو الإعلانات المسيئة أو من خلال دعم الدردشة المباشرة في حال ثبت لـ تطبيق وموقع هوم كويت أن المستخدم انتهك هذه الشروط والأحكام، سيكون لـ تطبيق وموقع هوم كويت الحق في تزويد الأطراف المتضررة ببيانات المستخدم المخالف عند الطلب.",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "حقوق الملكية الفكرية:",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "- يمتلك تطبيق وموقع هوم كويت كافة حقوق الملكية الفكرية للتطبيق وجميع محتويات التطبيق بما في ذلك البيانات والصور والمحتويات بكافة أشكالها المتوفرة على التطبيق والموقع الإلكتروني.\n- لا يجوز تحت أي ظرف من الظروف محاولة استخراج محتوى التطبيق أو بياناته بشكل كامل أو تلقائي أو استخراج أي جزء مادي منه يُمنع استخدام محتوى هذا التطبيق في أي عمل فكري آخر أو إدراجه في أي قاعدة بيانات إلكترونية يُمنع تمامًا إعادة بيع محتويات هذا التطبيق أو توزيعها أو تعديلها أو ترجمتها أو إعادة هندستها بأي شكل من الأشكال تحتفظ تطبيق وموقع هوم كويت بالحق الكامل في فرض القيود اللازمة لمنع أي شخص أو مواقع ويب أخرى من الارتباط أو استخراج محتوى هذا التطبيق والموقع.\n- يُحظر أيضًا إعادة هندسة أو تفكيك البرنامج المستخدم في التطبيق من أجل الوصول إلى الكود المصدري للبرنامج الأصلي أو البنية الأصلية لهذا التطبيق أو الموقع.\n- أي محاولة لانتهاك هذه الشروط بأي وسيلة ستعتبر انتهاكًا لحقوق الطبع والنشر والملكية الفكرية والسرقة ، وهو ما يعاقب عليه القانون",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "تعيين الحقوق للإعلانات والصور الموضوعة :",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "- يُراعى أن يتنازل المستخدم عن حقوق الإعلان والصور المرفقة به إلى تطبيق وموقع هوم كويت بمجرد تحميله على التطبيق.\n- يحتفظ تطبيق وموقع هوم كويت بحقها في إعادة استخدام الصور والمحتوى المنشور على الإعلانات بالشكل الذي تراه مناسبًا.",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
            SizedBox(
              height: 15.h,
            ),
            Text(
              "تعديل الشروط والأحكام :",
              style: GoogleFonts.tajawal(
                fontSize: 16.sp,
                fontWeight: FontWeight.bold,
                color: Color(0XFFFED235),
              ),
            ),
            SizedBox(
              height: 9.h,
            ),
            Text(
              "- يحق لـ تطبيق وموقع هوم كويت تعديل هذه الشروط والأحكام في أي وقت دون إشعار مسبق ستكون هذه التعديلات سارية بمجرد نشرها على التطبيق أو موقع الويب يجب على المستخدمين قراءة هذه الشروط والأحكام بعناية وبشكل منتظم لمراجعة أي تعديل عليها ويعتبر استمرار المستخدم في استخدام هذا التطبيق بعد تعديل الشروط والأحكام بمثابة موافقة صريحة على هذه التعديلات .",
              style: GoogleFonts.tajawal(
                fontSize: 14.sp,
                color: Color(0XFF505050),
              ),
            ),
          ],
        ),
      ),
    );
  }
}
